_org/iam/instance_profile.org
#+TITLE: Instance Profile
#+setupfile: ../setup.org

#+begin_src yaml
AWSTemplateFormatVersion: 2010-09-09
Description: >
  An IAM instance profile, which allows code running on an EC2 instance to
  assume an IAM role.
#+end_src

* Parameters

#+begin_src yaml
Parameters:
#+end_src

#+name: Params
| Param          | Value |
|----------------+-------|
| DeploymentName | cfc   |

** DeploymentName

#+begin_src yaml
  DeploymentName:
    Type: String
    Description: A name for this deployment
#+end_src

A *deployment* is a deployed application, potentially comprised of many
CloudFormation stacks. This is sometimes called an "environment", but that is an
overloaded and confusing term. Use the =DeploymentName= to indicate which
logical deployment a stack belongs to.

If a deployment is completely specified by exactly one CloudFormation template,
the =DeploymentName= and the [[https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/pseudo-parameter-reference.html#cfn-pseudo-param-stackname][AWS::StackName]] would refer to the same things. In
that case, consider not using a =DeploymentName= parameter.

* Resources

#+begin_src yaml
Resources:
#+end_src

** Role

#+begin_src yaml
  InstanceRole:
    Type: AWS::IAM::Role
    Properties:
      RoleName: !Sub "${DeploymentName}-InstanceRole"
      Description: Allows EC2 instances to call AWS services
      AssumeRolePolicyDocument:
        Version: 2012-10-17
        Statement:
          - Effect: Allow
            Principal:
              Service: ec2.amazonaws.com
            Action:
              - sts:AssumeRole
      ManagedPolicyArns:
        - !Ref InstancePolicy
#+end_src

** Policy

#+begin_src yaml
  InstancePolicy:
    Type: AWS::IAM::ManagedPolicy
    Properties:
      Description: Allow logging to CloudWatch
      ManagedPolicyName: !Sub "${DeploymentName}-InstancePolicy"
      PolicyDocument:
        Version: 2012-10-17
        Statement:
          - Effect: Allow
            Action:
              - logs:CreateLogGroup
              - logs:CreateLogStream
              - logs:PutLogEvents
              - logs:DescribeLogStreams
            Resource: "*"
#+end_src

** Instance Profile

#+begin_src yaml
  InstanceProfile:
    Type: AWS::IAM::InstanceProfile
    Properties:
      InstanceProfileName: !Sub "${DeploymentName}-InstanceProfile"
      Roles:
        - !Ref InstanceRole
#+end_src
