_out/iam/instance_profile.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Instance Profile </title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Instance Profile </h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4158bd5">Parameters</a>
<ul>
<li><a href="#org484309c">DeploymentName</a></li>
</ul>
</li>
<li><a href="#orgf6848ae">Resources</a>
<ul>
<li><a href="#orgcd7f12b">Role</a></li>
<li><a href="#org1fc84ce">Policy</a></li>
<li><a href="#org181ab1e">Instance Profile</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">AWSTemplateFormatVersion</span>: 2010-09-09
<span style="color: #dcaeea;">Description</span>: &gt;
  <span style="color: #98be65;">An IAM instance profile, which allows code running on an EC2 instance to</span>
<span style="color: #98be65;">  assume an IAM role.</span>
</pre>
</div>

<div id="outline-container-org4158bd5" class="outline-2">
<h2 id="org4158bd5"><a href="#org4158bd5">Parameters</a></h2>
<div class="outline-text-2" id="text-org4158bd5">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Parameters</span>:
</pre>
</div>

<table id="org9a58223">


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Param</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">DeploymentName</td>
<td class="org-left">cfc</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org484309c" class="outline-3">
<h3 id="org484309c"><a href="#org484309c">DeploymentName</a></h3>
<div class="outline-text-3" id="text-org484309c">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">DeploymentName</span>:
    <span style="color: #dcaeea;">Type</span>: String
    <span style="color: #dcaeea;">Description</span>: A name for this deployment
</pre>
</div>

<p>
A <b>deployment</b> is a deployed application, potentially comprised of many
CloudFormation stacks. This is sometimes called an "environment", but that is an
overloaded and confusing term. Use the <code>DeploymentName</code> to indicate which
logical deployment a stack belongs to.
</p>

<p>
If a deployment is completely specified by exactly one CloudFormation template,
the <code>DeploymentName</code> and the <a href="https://docs.aws.amazon.com/AWSCloudFormation/latest/UserGuide/pseudo-parameter-reference.html#cfn-pseudo-param-stackname">AWS::StackName</a> would refer to the same things. In
that case, consider not using a <code>DeploymentName</code> parameter.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf6848ae" class="outline-2">
<h2 id="orgf6848ae"><a href="#orgf6848ae">Resources</a></h2>
<div class="outline-text-2" id="text-orgf6848ae">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #dcaeea;">Resources</span>:
</pre>
</div>
</div>

<div id="outline-container-orgcd7f12b" class="outline-3">
<h3 id="orgcd7f12b"><a href="#orgcd7f12b">Role</a></h3>
<div class="outline-text-3" id="text-orgcd7f12b">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">InstanceRole</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::Role
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">RoleName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-InstanceRole"</span>
      <span style="color: #dcaeea;">Description</span>: Allows EC2 instances to call AWS services
      <span style="color: #dcaeea;">AssumeRolePolicyDocument</span>:
        <span style="color: #dcaeea;">Version</span>: 2012-10-17
        <span style="color: #dcaeea;">Statement</span>:
          - <span style="color: #dcaeea;">Effect</span>: Allow
            <span style="color: #dcaeea;">Principal</span>:
              <span style="color: #dcaeea;">Service</span>: ec2.amazonaws.com
            <span style="color: #dcaeea;">Action</span>:
              - sts:AssumeRole
      <span style="color: #dcaeea;">ManagedPolicyArns</span>:
        - <span style="color: #ECBE7B;">!Ref</span> InstancePolicy
</pre>
</div>
</div>
</div>

<div id="outline-container-org1fc84ce" class="outline-3">
<h3 id="org1fc84ce"><a href="#org1fc84ce">Policy</a></h3>
<div class="outline-text-3" id="text-org1fc84ce">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">InstancePolicy</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::ManagedPolicy
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">Description</span>: Allow logging to CloudWatch
      <span style="color: #dcaeea;">ManagedPolicyName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-InstancePolicy"</span>
      <span style="color: #dcaeea;">PolicyDocument</span>:
        <span style="color: #dcaeea;">Version</span>: 2012-10-17
        <span style="color: #dcaeea;">Statement</span>:
          - <span style="color: #dcaeea;">Effect</span>: Allow
            <span style="color: #dcaeea;">Action</span>:
              - logs:CreateLogGroup
              - logs:CreateLogStream
              - logs:PutLogEvents
              - logs:DescribeLogStreams
            <span style="color: #dcaeea;">Resource</span>: <span style="color: #98be65;">"*"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org181ab1e" class="outline-3">
<h3 id="org181ab1e"><a href="#org181ab1e">Instance Profile</a></h3>
<div class="outline-text-3" id="text-org181ab1e">
<div class="org-src-container">
<pre class="src src-yaml">  <span style="color: #dcaeea;">InstanceProfile</span>:
    <span style="color: #dcaeea;">Type</span>: AWS::IAM::InstanceProfile
    <span style="color: #dcaeea;">Properties</span>:
      <span style="color: #dcaeea;">InstanceProfileName</span>: <span style="color: #ECBE7B;">!Sub</span> <span style="color: #98be65;">"${DeploymentName}-InstanceProfile"</span>
      <span style="color: #dcaeea;">Roles</span>:
        - <span style="color: #ECBE7B;">!Ref</span> InstanceRole
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
